app/Models/Modelproduct.php

	function datashow(){
		return $this->db->table('pemesanan')->get();
---
SELECT *
FROM `pemesanan`

    function ambildata($nik){
		return $this->db->table('pemesanan')->getWhere(['nik' => $nik]);
---
SELECT *
FROM `pemesanan`
WHERE `nik` = '3172098000002312'